//* Завдання 1
// Дано масив чисел. Потрібно визначити, чи є у ньому хоча б одне від'ємне число. Якщо є, то повернути масив, в якому кожен елемент масиву буде додатнім числом.

// Вхідні дані: масив чисел.

// Вихідні дані: масив додатніх чисел або повідомлення "No negative numbers found".

// Приклад вхідних даних:
// let arr = [3, -2, 5, 6, -8, 2];

//* Завдання 2
// Дано масив чисел. Потрібно знайти суму всіх додатних чисел у масиві, які є кратними числу 3.

// Вхідні дані: масив чисел

// Вихідні дані: сума всіх додатних чисел у масиві, які є кратними числу 3.

// Приклад вхідних даних: [3, 5, -9, 7, 2, 8, 10, -6]

// Приклад вихідних даних: 9

//!!!! Все я вище я вже робив у поза минулому пакеті дз

// * Завдання 3
// У вас є масив, який містить числа. Необхідно знайти всі числа, які є парними і більшими за 10, і повернути їх у зворотньому порядку.

// Наприклад, масив: [5, 14, 8, 20, 3, 11, 17, 4]

// Відповідь: [20, 14]

// Для вирішення цієї задачі можна використовувати методи filter() та reverse().

// Використаю ланцюг методів
const arr_for_task_1 = [5, 14, 8, 20, 3, 11, 17, 4];
const task_1 = arr_for_task_1
  .filter((number) => {
    return number > 10 && number % 2 == 0;
  })
  .reverse();
console.log(task_1);

// * Завдання 4
// У нас є список книг, і ми хочемо відфільтрувати цей список за певною категорією, а потім групувати книги за авторами. При цьому ми хочемо вивести лише імена авторів та список їхніх книг.

// Список книг
const books = [
  { title: "Book 1", author: "Author A", category: "Fiction" },
  { title: "Book 2", author: "Author B", category: "Non-Fiction" },
  { title: "Book 3", author: "Author A", category: "Fiction" },
  { title: "Book 4", author: "Author C", category: "Mystery" },
  { title: "Book 5", author: "Author B", category: "Fiction" },
];

// Ok

const filter_and_group = (arr, checkpoint) => {
  return arr
    .filter((book) => {
      return book.category === checkpoint;
    })
    .map(({ author, title }) => ({ author, title }))
    .reduce((acc, book) => {
      const {title, author} = book;
      if (acc[author]) {
        acc[author].push(title);
      } else {
        acc[author] = [title];
      }
      return acc;
    }, {});
};


console.log(filter_and_group(books, "Fiction"));

// фууух, останнє завдання було найважче, а саме розібратися з редус методом :()
